# Creating a DataFrame

In [3]:
#Createing DataFrame fro List of Lists

In [2]:
import pandas as pd

In [5]:
list_data = [["C1", 5, "Jakarta"], ["C2", 10, "Bogor"], ["C3", 7, "Tangerang"], ["C4", 0, "Jakarta"]]

In [6]:
df = pd.DataFrame(list_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4            0    Jakarta

In [7]:
#Creating DataFrame from Numpy Array

In [8]:
import numpy as np

In [9]:
numpy_data = np.array(list_data)
numpy_data

array([['C1', '5', 'Jakarta'],
       ['C2', '10', 'Bogor'],
       ['C3', '7', 'Tangerang'],
       ['C4', '0', 'Jakarta']], dtype='<U11')

In [10]:
df = pd.DataFrame(numpy_data, columns = ["cust_id", "item_bought", "city"])
df

  cust_id item_bought       city
0      C1           5    Jakarta
1      C2          10      Bogor
2      C3           7  Tangerang
3      C4           0    Jakarta

In [11]:
#Creating DataFrame from Dictionary

In [12]:
dict_data = { "cust_id": ["C1", "C2", "C3", "C4"],
             "item_bought": [5,10,7,10],
             "city": ["Jakarta", "Bogor", "Tangerang", "Jakarta"]}

dict_data

{'cust_id': ['C1', 'C2', 'C3', 'C4'],
 'item_bought': [5, 10, 7, 10],
 'city': ['Jakarta', 'Bogor', 'Tangerang', 'Jakarta']}

In [13]:
df = pd.DataFrame(dict_data)
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [14]:
#Saving a DataFrame

In [15]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [16]:
df.to_csv("customer_info.csv", index = False)

In [17]:
df.to_excel("customer_info.xlsx", index = False)

In [18]:
#Load a DataFrame

In [19]:
df = pd.read_csv("customer_info.csv")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [20]:
df = pd.read_excel("customer_info.xlsx")
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

## Basic Operations

In [21]:
#Summary Infor

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   cust_id      4 non-null      object
 1   item_bought  4 non-null      int64
 2   city         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [23]:
#Statistics of Numerical Columns

In [24]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [25]:
df.describe()

       item_bought
count      4.00000
mean       8.00000
std        2.44949
min        5.00000
25%        6.50000
50%        8.50000
75%       10.00000
max       10.00000

In [26]:
#Columns Name

In [27]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [28]:
df.columns

Index(['cust_id', 'item_bought', 'city'], dtype='object')

In [29]:
list(df.columns)

['cust_id', 'item_bought', 'city']

In [30]:
for i in list(df.columns):
    print(i + " ?")

cust_id ?
item_bought ?
city ?

In [31]:
#DataFrame length

In [32]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [33]:
df.shape

(4, 3)

In [34]:
# banyaknya baris
df.shape[0]

4

In [35]:
# banyaknya kolom
df.shape[1]

3

In [36]:
# values of a particular column

In [37]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [38]:
df["cust_id"] # ini namanya tipe pandas series atau vector

0    C1
1    C2
2    C3
3    C4
Name: cust_id, dtype: object

In [39]:
df["item_bought"] # pandas series item_bought

0     5
1    10
2     7
3    10
Name: item_bought, dtype: int64

In [40]:
df["city"]

0      Jakarta
1        Bogor
2    Tangerang
3      Jakarta
Name: city, dtype: object

In [41]:
# Values of several columns

In [42]:
df[["cust_id","item_bought"]] # Ini bukan pandas series, tapi ini masih pandas dataframe

  cust_id  item_bought
0      C1            5
1      C2           10
2      C3            7
3      C4           10

In [43]:
df[["cust_id","city"]]

  cust_id       city
0      C1    Jakarta
1      C2      Bogor
2      C3  Tangerang
3      C4    Jakarta

In [44]:
df[["item_bought","city"]]

   item_bought       city
0            5    Jakarta
1           10      Bogor
2            7  Tangerang
3           10    Jakarta

In [45]:
# First N Row

In [46]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [47]:
df.head() # Secara Default, bakal nunjukkin 5 data

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [48]:
df.head(1)

  cust_id  item_bought     city
0      C1            5  Jakarta

In [49]:
df.head(2) # Bisa dipake buat preview data, soalnya kalau datanya banyak bisa lama nampilinnya

  cust_id  item_bought     city
0      C1            5  Jakarta
1      C2           10    Bogor

In [50]:
# Last N Rows

In [51]:
df.tail()

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [52]:
df.tail(1)

  cust_id  item_bought     city
3      C4           10  Jakarta

In [53]:
df.tail(3)

  cust_id  item_bought       city
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [54]:
# Random N Rows (Kak Stephanie lebih sering pake ini untuk liat random sample biar lebih presentatif)

In [55]:
df.sample() # Klo ga ngasih sample, dia bakal nunjukkin cuma 1 data

  cust_id  item_bought       city
2      C3            7  Tangerang

In [56]:
df.sample(3)

  cust_id  item_bought       city
2      C3            7  Tangerang
1      C2           10      Bogor
3      C4           10    Jakarta

In [57]:
# Sorting Data

In [58]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [59]:
df.sort_values(by = "item_bought", ascending = False)

  cust_id  item_bought       city
1      C2           10      Bogor
3      C4           10    Jakarta
2      C3            7  Tangerang
0      C1            5    Jakarta

In [60]:
df.sort_values(by = "item_bought")

  cust_id  item_bought       city
0      C1            5    Jakarta
2      C3            7  Tangerang
1      C2           10      Bogor
3      C4           10    Jakarta

In [61]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False) # Mengurutkan berdasarkan dua kolom

  cust_id  item_bought       city
3      C4           10    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
0      C1            5    Jakarta

In [62]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False).reset_index() # Biar index nya urut, ga acak2an

   index cust_id  item_bought       city
0      3      C4           10    Jakarta
1      1      C2           10      Bogor
2      2      C3            7  Tangerang
3      0      C1            5    Jakarta

In [63]:
df.sort_values(by = ["item_bought", "cust_id"], ascending = False).reset_index(drop = True) # Klo ga butuh index lama

  cust_id  item_bought       city
0      C4           10    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C1            5    Jakarta

In [64]:
# Rename Column

In [65]:
df

  cust_id  item_bought       city
0      C1            5    Jakarta
1      C2           10      Bogor
2      C3            7  Tangerang
3      C4           10    Jakarta

In [66]:
df.rename(columns = {"cust_id": "customer_id", "item_bought": "num_of_items"})

  customer_id  num_of_items       city
0          C1             5    Jakarta
1          C2            10      Bogor
2          C3             7  Tangerang
3          C4            10    Jakarta

In [67]:
df.columns = ['cust_id2', 'item_bought2', 'city2']
df

  cust_id2  item_bought2      city2
0       C1             5    Jakarta
1       C2            10      Bogor
2       C3             7  Tangerang
3       C4            10    Jakarta

In [68]:
# Converting Data Types

In [69]:
df

  cust_id2  item_bought2      city2
0       C1             5    Jakarta
1       C2            10      Bogor
2       C3             7  Tangerang
3       C4            10    Jakarta

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      int64
 2   city2         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [71]:
df["item_bought2"] = df["item_bought2"].astype("float64")

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      float64
 2   city2         4 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [73]:
df["item_bought2"] = df["item_bought2"].astype("int64")

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      int64
 2   city2         4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [75]:
df["item_bought2"] = df["item_bought2"].astype("object")

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cust_id2      4 non-null      object
 1   item_bought2  4 non-null      object
 2   city2         4 non-null      object
dtypes: object(3)
memory usage: 228.0+ bytes

## Data Filtering

In [77]:
df = pd.DataFrame({
    "cust_id": ["C1","C2","C3","C4","C5","C6","C7","C8","C9","C10"],
    "item_bought": [10,15,20,35,4,10,2,0,9,15],
    "city": ["Bandung","Jakarta","Bogor","Tangerang","Bali","Jakarta","Jakarta","Bandung","Bogor","Jakarta"]
})

df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [78]:
# Loc : Filter data berdasarkan nama dari baris/kolom

In [79]:
# Single Value

df.loc[0,"cust_id"]

'C1'

In [80]:
df.loc[5,"city"]

'Jakarta'

In [81]:
df.loc[1,"item_bought"]

15

In [82]:
# Range of rows / columns

In [83]:
df.loc[0:4, "cust_id"] # tipe data pandas series

0    C1
1    C2
2    C3
3    C4
4    C5
Name: cust_id, dtype: object

In [84]:
df.loc[0:4, ["cust_id", "city"]] # tipe data pandas DataFrame

  cust_id       city
0      C1    Bandung
1      C2    Jakarta
2      C3      Bogor
3      C4  Tangerang
4      C5       Bali

In [85]:
df.loc[2, ["cust_id", "city"]]

cust_id       C3
city       Bogor
Name: 2, dtype: object

In [86]:
# iloc = mirip dengan list(berdasarkan index)

In [87]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [88]:
# Single Value

df.iloc[0, 0]

'C1'

In [89]:
df.iloc[2, 2]

'Bogor'

In [90]:
df.iloc[5, 1]

10

In [91]:
df.iloc[0:2, 0]

0    C1
1    C2
Name: cust_id, dtype: object

In [92]:
df.iloc[0:2, 0:2]

  cust_id  item_bought
0      C1           10
1      C2           15

In [93]:
# Filter dataframe with a criteria

In [94]:
# Object

In [95]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [96]:
df[(df["city"] == "Jakarta")]

  cust_id  item_bought     city
1      C2           15  Jakarta
5      C6           10  Jakarta
6      C7            2  Jakarta
9     C10           15  Jakarta

In [97]:
df[(df["cust_id"] == "C7")]

  cust_id  item_bought     city
6      C7            2  Jakarta

In [98]:
# Numeric

In [99]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [100]:
df[(df["item_bought"] > 10)]

  cust_id  item_bought       city
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
9     C10           15    Jakarta

In [101]:
df[(df["item_bought"] <= 10)]

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
5      C6           10  Jakarta
6      C7            2  Jakarta
7      C8            0  Bandung
8      C9            9    Bogor

In [102]:
# Negative of a criteria

In [103]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [105]:
df[(df["item_bought"] > 10)]

  cust_id  item_bought       city
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
9     C10           15    Jakarta

In [106]:
df[~(df["item_bought"] > 10)] # ini negasinya

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
5      C6           10  Jakarta
6      C7            2  Jakarta
7      C8            0  Bandung
8      C9            9    Bogor

In [108]:
# Filter dataframe with several criterias (AND)

In [109]:
df

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
8      C9            9      Bogor
9     C10           15    Jakarta

In [111]:
df[(df["item_bought"] > 10) & (df["city"] != "Bogor")]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
9     C10           15    Jakarta

In [112]:
df[~((df["item_bought"] > 10) & (df["city"] != "Bogor"))]

  cust_id  item_bought     city
0      C1           10  Bandung
2      C3           20    Bogor
4      C5            4     Bali
5      C6           10  Jakarta
6      C7            2  Jakarta
7      C8            0  Bandung
8      C9            9    Bogor

In [113]:
# Filter dataframe with several criterias (OR)

In [114]:
df[(df["item_bought"] > 10) | (df["city"] != "Bogor")]

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           10    Jakarta
6      C7            2    Jakarta
7      C8            0    Bandung
9     C10           15    Jakarta

In [115]:
df[~((df["item_bought"] > 10) | (df["city"] != "Bogor"))]

  cust_id  item_bought   city
8      C9            9  Bogor

In [116]:
# Filter with isin operation

In [118]:
list_of_cities = ["Jakarta", "Tangerang", "Depok"]

In [120]:
df[(df["city"].isin(list_of_cities))]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
5      C6           10    Jakarta
6      C7            2    Jakarta
9     C10           15    Jakarta

In [121]:
df[(df["city"] == "Jakarta") | (df["city"] == "Tangerang") | (df["city"] == "Depok")]

  cust_id  item_bought       city
1      C2           15    Jakarta
3      C4           35  Tangerang
5      C6           10    Jakarta
6      C7            2    Jakarta
9     C10           15    Jakarta

In [122]:
list_cust = ["C1", "C5", "C7"]

In [123]:
df[(df["cust_id"].isin(list_cust))]

  cust_id  item_bought     city
0      C1           10  Bandung
4      C5            4     Bali
6      C7            2  Jakarta

## Case Study 1

In [3]:
customers = pd.DataFrame({
    "id": [1,2,3,4],
    "name": ["Joe","Henry","Sam","Max"]
})

In [4]:
customers

   id   name
0   1    Joe
1   2  Henry
2   3    Sam
3   4    Max

In [5]:
orders = pd.DataFrame({
    "id": [1,2],
    "customer_id": [3,1]
})

In [6]:
orders

   id  customer_id
0   1            3
1   2            1

In [13]:
id_order_list = list(orders["customer_id"])
id_order_list

[3, 1]

In [15]:
customers[(customers["id"].isin(id_order_list))]

   id name
0   1  Joe
2   3  Sam

In [25]:
df_cust_not_order = customers[~(customers["id"].isin(id_order_list))].sort_values(by="name", ascending = False).reset_index(drop = True)

In [26]:
df_cust_not_order

   id   name
0   4    Max
1   2  Henry

In [29]:
list_name = list(df_cust_not_order["name"])
list_name

['Max', 'Henry']

In [31]:
result = pd.DataFrame({
    "Inactive Customers" : list_name
})

result

  Inactive Customers
0                Max
1              Henry

In [41]:
inactive_customers = pd.DataFrame()
inactive_customers

Empty DataFrame
Columns: []
Index: []

In [42]:
inactive_customers["Inactive Customers"] = customers[~(customers["id"].isin(orders["customer_id"]))]["name"]
inactive_customers = inactive_customers.sort_values(by = "Inactive Customers", ascending = False)
inactive_customers = inactive_customers.reset_index(drop = True)

In [43]:
inactive_customers

  Inactive Customers
0                Max
1              Henry

## Data Aggregation

In [50]:
iris = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/refs/heads/master/iris.csv")

In [51]:
iris.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
102           7.1          3.0           5.9          2.1   virginica
21            5.1          3.7           1.5          0.4      setosa
6             4.6          3.4           1.4          0.3      setosa
72            6.3          2.5           4.9          1.5  versicolor
127           6.1          3.0           4.9          1.8   virginica

In [52]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [49]:
# Value Counts

In [53]:
iris["species"].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [54]:
iris["petal_length"].value_counts()

1.4    13
1.5    13
5.1     8
4.5     8
1.6     7
1.3     7
5.6     6
4.7     5
4.9     5
4.0     5
4.2     4
5.0     4
4.4     4
4.8     4
1.7     4
3.9     3
4.6     3
5.7     3
4.1     3
5.5     3
6.1     3
5.8     3
3.3     2
5.4     2
6.7     2
5.3     2
5.9     2
6.0     2
1.2     2
4.3     2
1.9     2
3.5     2
5.2     2
3.0     1
1.1     1
3.7     1
3.8     1
6.6     1
6.3     1
1.0     1
6.9     1
3.6     1
6.4     1
Name: petal_length, dtype: int64

In [55]:
# Group By, 1 aggregation

In [56]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [57]:
iris.groupby(["species"]).count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [58]:
iris.groupby(["species"]).min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [59]:
iris.groupby(["species"]).max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [60]:
iris.groupby(["species"]).sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        171.4          73.1         12.3
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [61]:
iris.groupby(["species"]).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [62]:
 iris.groupby(["species"]).median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [64]:
 iris.groupby(["species"]).describe()

           sepal_length                                              \
                  count   mean       std  min    25%  50%  75%  max
species
setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [65]:
 iris.groupby(["species"]).describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [66]:
df = iris.groupby(["species"]).mean()
df

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [73]:
df = iris.groupby(["species"]).mean().reset_index()
df

      species  sepal_length  sepal_width  petal_length  petal_width
0      setosa         5.006        3.428         1.462        0.246
1  versicolor         5.936        2.770         4.260        1.326
2   virginica         6.588        2.974         5.552        2.026

In [74]:
df[(df["species"] == "setosa")]

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa         5.006        3.428         1.462        0.246

In [75]:
# Group By, 2 or more aggregation

In [86]:
iris.groupby(["species"]).agg(["min","max"])

           sepal_length      sepal_width      petal_length      petal_width  \
                    min  max         min  max          min  max         min
species
setosa              4.3  5.8         2.3  4.4          1.0  1.9         0.1
versicolor          4.9  7.0         2.0  3.4          3.0  5.1         1.0
virginica           4.9  7.9         2.2  3.8          4.5  6.9         1.4


            max
species
setosa      0.6
versicolor  1.8
virginica   2.5

In [88]:
iris.groupby(["species"]).agg({"sepal_length": ["min","sum"], "sepal_width": ["max","mean"]})

           sepal_length        sepal_width
                    min    sum         max   mean
species
setosa              4.3  250.3         4.4  3.428
versicolor          4.9  296.8         3.4  2.770
virginica           4.9  329.4         3.8  2.974

## Data Merging

In [89]:
df1 = pd.DataFrame({
    "cust_id": ["C1","C2","C3","C4","C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung","Jakarta","Bogor","Tangerang","Bali"]
})

df1

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [93]:
df3 = pd.DataFrame({
    "cust_no": ["C1","C2","C3","C5","C6","C7","C8"],
    "age": [24,31,23,40,35,28,34]
})

df3

  cust_no  age
0      C1   24
1      C2   31
2      C3   23
3      C5   40
4      C6   35
5      C7   28
6      C8   34

In [94]:
df1.merge(df3, how = "left", left_on = "cust_id", right_on = "cust_no")

  cust_id  item_bought       city cust_no   age
0      C1           10    Bandung      C1  24.0
1      C2           15    Jakarta      C2  31.0
2      C3           20      Bogor      C3  23.0
3      C4           35  Tangerang     NaN   NaN
4      C5            4       Bali      C5  40.0

In [95]:
df1.merge(df3, how = "right", left_on = "cust_id", right_on = "cust_no")

  cust_id  item_bought     city cust_no  age
0      C1         10.0  Bandung      C1   24
1      C2         15.0  Jakarta      C2   31
2      C3         20.0    Bogor      C3   23
3      C5          4.0     Bali      C5   40
4     NaN          NaN      NaN      C6   35
5     NaN          NaN      NaN      C7   28
6     NaN          NaN      NaN      C8   34

In [97]:
df3.merge(df1, how = "left", left_on = "cust_no", right_on = "cust_id")

  cust_no  age cust_id  item_bought     city
0      C1   24      C1         10.0  Bandung
1      C2   31      C2         15.0  Jakarta
2      C3   23      C3         20.0    Bogor
3      C5   40      C5          4.0     Bali
4      C6   35     NaN          NaN      NaN
5      C7   28     NaN          NaN      NaN
6      C8   34     NaN          NaN      NaN

In [98]:
df1.merge(df3, how = "inner", left_on = "cust_id", right_on = "cust_no")

  cust_id  item_bought     city cust_no  age
0      C1           10  Bandung      C1   24
1      C2           15  Jakarta      C2   31
2      C3           20    Bogor      C3   23
3      C5            4     Bali      C5   40

In [100]:
df1.merge(df3, how = "outer", left_on = "cust_id", right_on = "cust_no")

  cust_id  item_bought       city cust_no   age
0      C1         10.0    Bandung      C1  24.0
1      C2         15.0    Jakarta      C2  31.0
2      C3         20.0      Bogor      C3  23.0
3      C4         35.0  Tangerang     NaN   NaN
4      C5          4.0       Bali      C5  40.0
5     NaN          NaN        NaN      C6  35.0
6     NaN          NaN        NaN      C7  28.0
7     NaN          NaN        NaN      C8  34.0

In [101]:
df1.merge(df3, how = "inner", left_on = "cust_id", right_on = "cust_no").drop(columns = ["cust_no"])

  cust_id  item_bought     city  age
0      C1           10  Bandung   24
1      C2           15  Jakarta   31
2      C3           20    Bogor   23
3      C5            4     Bali   40

In [103]:
# Concat

In [104]:
df1 = pd.DataFrame({
    "cust_id": ["C1","C2","C3","C4","C5"],
    "item_bought": [10,15,20,35,4],
    "city": ["Bandung","Jakarta","Bogor","Tangerang","Bali"]
})

df1

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali

In [105]:
df2 = pd.DataFrame({
    "cust_id": ["C6","C7","C8"],
    "item_bought": [12,20,6],
    "city": ["Bandung","Jakarta","Jakarta"]
})

df2

  cust_id  item_bought     city
0      C6           12  Bandung
1      C7           20  Jakarta
2      C8            6  Jakarta

In [109]:
pd.concat([df1,df2]).reset_index(drop = True)

  cust_id  item_bought       city
0      C1           10    Bandung
1      C2           15    Jakarta
2      C3           20      Bogor
3      C4           35  Tangerang
4      C5            4       Bali
5      C6           12    Bandung
6      C7           20    Jakarta
7      C8            6    Jakarta

## Apply & ApplyMap Method

In [111]:
df = pd.DataFrame({
    'A': [1,2,3,4],
    'B': [10,20,30,40],
    'C': [20,40,60,80],
})

df

   A   B   C
0  1  10  20
1  2  20  40
2  3  30  60
3  4  40  80

In [112]:
# Apply

In [114]:
def sum(x):
    result = x.sum()
    return result

df["D"] = df.apply(sum, axis = 1)

In [115]:
df

   A   B   C    D
0  1  10  20   31
1  2  20  40   62
2  3  30  60   93
3  4  40  80  124

In [117]:
df.loc[4,:] = df.apply(sum, axis = 0)

In [118]:
df

      A      B      C      D
0   1.0   10.0   20.0   31.0
1   2.0   20.0   40.0   62.0
2   3.0   30.0   60.0   93.0
3   4.0   40.0   80.0  124.0
4  10.0  100.0  200.0  310.0

In [121]:
def multiply_by_2(x):
    return x*2

df["E"] = df["B"].apply(multiply_by_2) # Ga perlu pake axis karena kita apply ke series, bukan dataframe

In [122]:
df

      A      B      C      D      E
0   1.0   10.0   20.0   31.0   20.0
1   2.0   20.0   40.0   62.0   40.0
2   3.0   30.0   60.0   93.0   60.0
3   4.0   40.0   80.0  124.0   80.0
4  10.0  100.0  200.0  310.0  200.0

In [124]:
# Lambda

In [123]:
df = pd.DataFrame({
    'A': [1,2,3,4],
    'B': [10,20,30,40],
    'C': [20,40,60,80],
})

df

   A   B   C
0  1  10  20
1  2  20  40
2  3  30  60
3  4  40  80

In [126]:
df["D"] = df.apply(lambda x: x.sum(), axis = 1)

In [127]:
df

   A   B   C    D
0  1  10  20   31
1  2  20  40   62
2  3  30  60   93
3  4  40  80  124

In [128]:
df.loc[4,:] = df.apply(lambda x: x.sum(), axis = 0)

In [129]:
df

      A      B      C      D
0   1.0   10.0   20.0   31.0
1   2.0   20.0   40.0   62.0
2   3.0   30.0   60.0   93.0
3   4.0   40.0   80.0  124.0
4  10.0  100.0  200.0  310.0

In [130]:
df["E"] = df["B"].apply(lambda x: x*2)

In [131]:
df

      A      B      C      D      E
0   1.0   10.0   20.0   31.0   20.0
1   2.0   20.0   40.0   62.0   40.0
2   3.0   30.0   60.0   93.0   60.0
3   4.0   40.0   80.0  124.0   80.0
4  10.0  100.0  200.0  310.0  200.0